import React , { Component } from "react"
import TextSection from "../components/TextSection"


class About extends Component{

    render(){
        
        const aboutus = "Η Λέσχης Ρομποτικής του ΕΛΜΕΠΑ είναι μία ομάδα φοιτητών που έχει ως σκοπό να δώσει στους φοιτητές την ευκαιρία να γνωρίσουν τους κλάδους που σχετίζονται με τη Ρομποτική. Μέσω σεμιναρίων, projects και διαγωνισμών, τα μέλη μας διευρύνουν τις γνώσεις τους αλληλεπιδρώντας με συμφοιτητές τους, με τους οποίους μοιράζονται το ίδιο πάθος. Ανακαλύπτοντας τους κλάδους που απαρτίζουν τη Ρομποτική, μαθαίνουν να δημιουργούν ομαδικά σε ένα φιλικό περιβάλλον. Ευπρόσδεκτοι είναι φοιτητές από κάθε σχολή και έτος φοίτησης."
        const sem = "Στη Λέσχη Ρομποτικής του ΕΛΜΕΠΑ, σκοπός μας είναι ο κάθε φοιτητής να βρει τον τομέα που τον εκφράζει και να χτίσει σιγά σιγά τις απαραίτητες γνώσεις πάνω σε αυτόν. Για το λόγο αυτό διενεργούνται σεμινάρια, ώστε όλοι να μπορούν να πάρουν μια γεύση από κάθε πτυχή που σχηματίζει τον φανταστικό αυτό κόσμο της Ρομποτικής και να μπορέσουν να εντρυφήσουν σε αυτόν. Τα σεμινάρια οργανώνονται και πραγματοποιούνται από προπτυχιακούς φοιτητές μέχρι και καθηγητές, μεταλαμπαδεύοντας τις γνώσεις τους στα μέλη της Λέσχης Ρομποτικής δημιουργώντας μια συνέχεια στην προσπάθεια μας."
        
        return(
            <div>
                <TextSection text={aboutus} img={"/Media/aboutUs.jpg"} name={"About"}/>
                <TextSection text={sem} img={"/Media/python.jpg"} name={"Seminars"}/>
            </div>
        )
    }
}

export default About