import "./About.css"

function About(props){
    return(
        <div className="about-cont">
            <div className="about-first-right">
                <div id="about-img-1"></div>
                <div className="about-text-cont">
                    <p className="about-text">Η Λέσχης Ρομποτικής του ΕΛΜΕΠΑ είναι μία ομάδα φοιτητών που έχει ως σκοπό να δώσει στους φοιτητές την ευκαιρία να γνωρίσουν τους κλάδους που σχετίζονται με τη Ρομποτική. Μέσω σεμιναρίων, projects και διαγωνισμών. τα μέλη μας διευρύνουν τις γνώσεις τους αλληλεπιδρώντας με συμφοιτητές τους, με τους οποίους μοιράζονται το ίδιο πάθος.</p>
                </div>
                
            </div>
            <div className="about-second-left">
                <div className="about-text-cont">
                    <p className="about-text">Στη Λέσχη Ρομποτικής του ΕΛΜΕΠΑ, σκοπός μας είναι ο κάθε φοιτητής να βρει τον τομέα που τον εκφράζει και να χτίσει σιγά σιγά τις απαραίτητες γνώσεις πάνω σε αυτόν. Για το λόγο αυτό διενεργούνται σεμινάρια, ώστε όλοι να μπορούν να πάρουν μια γεύση από κάθε πτυχή που σχηματίζει τον φανταστικό αυτό κόσμο της Ρομποτικής και να μπορέσουν να εντρυφήσουν σε αυτόν. Τα σεμινάρια οργανώνονται και πραγματοποιούνται από προπτυχιακούς φοιτητές μέχρι και καθηγητές, μεταλαμπαδεύοντας τις γνώσεις τους στα μέλη της Λέσχης Ρομποτικής δημιουργώντας μια συνέχεια στην προσπάθεια μας.</p>
                </div>     
                <div id="about-img-2"></div>
            </div>
        </div>
    )
}


export default About